---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDeformedShapeTextLabelType
source: html/09990772-9602-6970-ea6a-c1bde188344a.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDeformedShapeTextLabelType

Defines text visualization types for deformed shape settings of analysis display style.

## Syntax (C#)
```csharp
public enum AnalysisDisplayStyleDeformedShapeTextLabelType
```